; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 7004)
	(= (fuel plane1) 1948)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 8)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city1)
	(= (capacity plane2) 11850)
	(= (fuel plane2) 2693)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at person1 city0)
	(at person2 city0)
	(at person3 city0)
	(at person4 city0)
	(at person5 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 625)
	(= (distance city0 city2) 718)
	(= (distance city1 city0) 625)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 974)
	(= (distance city2 city0) 718)
	(= (distance city2 city1) 974)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at person1 city0)
	(at person2 city1)
	(at person3 city2)
	(at person4 city1)
	(at person5 city0)
	))

(:metric minimize (+ (* 4 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane1 city2)
   changed: (fuel plane1) from 1948 to 7004
   goals met: 2 of 6
2. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 2154, (fuel plane1) from 7004 to 4850
   goals met: 2 of 6
3. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 6
4. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 6
5. (board person4 plane1 city0)
   deleted: (at person4 city0)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 6
6. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 2154 to 4029, (fuel plane1) from 4850 to 2975
   goals met: 3 of 6
7. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 6
8. (debark person4 plane1 city1)
   deleted: (in person4 plane1)
   added: (at person4 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 6
9. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 4029 to 6951, (fuel plane1) from 2975 to 53
   goals met: 4 of 6
10. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 6
11. (refuel plane1 city2)
   changed: (fuel plane1) from 53 to 7004
   goals met: 5 of 6
12. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 6951 to 9873, (fuel plane1) from 7004 to 4082
   goals met: 6 of 6
